sparkfun/Arduino_Apollo3/boards.txt
# Copyright (c) 2019 SparkFun Electronics

# Permission is hereby granted, free of charge, to any person obtaining a copy
# of this software and associated documentation files (the "Software"), to deal
# in the Software without restriction, including without limitation the rights
# to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
# copies of the Software, and to permit persons to whom the Software is
# furnished to do so, subject to the following conditions:

# The above copyright notice and this permission notice shall be included in all
# copies or substantial portions of the Software.

# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
# AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
# OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
# SOFTWARE.

###############################################################

artemis.name=SparkFun Artemis Module
artemis.build.variant=SparkFun_Artemis
artemis.build.board=SFE_ARTEMIS
artemis.upload.tool=artemis_uart
artemis.upload.maximum_size=960000
artemis.build.arch=APOLLO3
artemis.build.mcu=cortex-m4
artemis.build.f_cpu=48000000L
artemis.build.core=arduino
artemis.build.defs=
artemis.build.includes=-I{build.variant.path}/config
artemis.build.libs=
artemis.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
artemis.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
artemis.upload.maximum_size=960000
edge.upload.use_menu_baud=0
artemis.upload.baud=115200

###############################################################

amap3blackboard.name=SparkFun BlackBoard Artemis
amap3blackboard.build.variant=SparkFun_BlackBoard_Artemis
amap3blackboard.build.board=AM_AP3_SFE_BB_ARTEMIS
amap3blackboard.upload.tool=artemis_uart
amap3blackboard.upload.maximum_size=960000
amap3blackboard.build.arch=APOLLO3
amap3blackboard.build.mcu=cortex-m4
amap3blackboard.build.f_cpu=48000000L
amap3blackboard.build.core=arduino
amap3blackboard.build.defs=
amap3blackboard.build.includes=-I{build.variant.path}/config
amap3blackboard.build.libs=
amap3blackboard.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3blackboard.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3blackboard.upload.maximum_size=960000
edge.upload.use_menu_baud=0
amap3blackboard.upload.baud=115200

###############################################################

amap3nano.name=SparkFun BlackBoard Artemis Nano
amap3nano.build.variant=SparkFun_BlackBoard_Artemis_Nano
amap3nano.build.board=AM_AP3_SFE_BB_ARTEMIS_NANO
amap3nano.upload.tool=artemis_uart
amap3nano.upload.maximum_size=960000
amap3nano.build.arch=APOLLO3
amap3nano.build.mcu=cortex-m4
amap3nano.build.f_cpu=48000000L
amap3nano.build.core=arduino
amap3nano.build.defs=
amap3nano.build.includes=-I{build.variant.path}/config
amap3nano.build.libs=
amap3nano.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3nano.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3nano.upload.maximum_size=960000
edge.upload.use_menu_baud=0
amap3nano.upload.baud=115200

###############################################################

amap3mega.name=SparkFun BlackBoard Artemis Mega
amap3mega.build.variant=SparkFun_BlackBoard_Artemis_Mega
amap3mega.build.board=AM_AP3_SFE_BB_ARTEMIS_MEGA
amap3mega.upload.tool=artemis_uart
amap3mega.upload.maximum_size=960000
amap3mega.build.arch=APOLLO3
amap3mega.build.mcu=cortex-m4
amap3mega.build.f_cpu=48000000L
amap3mega.build.core=arduino
amap3mega.build.defs=
amap3mega.build.includes=-I{build.variant.path}/config
amap3mega.build.libs=
amap3mega.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3mega.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3mega.upload.maximum_size=960000
edge.upload.use_menu_baud=0
amap3mega.upload.baud=115200

###############################################################

edge.name=SparkFun Edge
edge.build.variant=SparkFun_Edge
edge.build.board=SFE_EDGE
edge.upload.tool=artemis_bin2board
edge.upload.maximum_size=960000
edge.build.arch=APOLLO3
edge.build.mcu=cortex-m4
edge.build.f_cpu=48000000L
edge.build.core=arduino
edge.build.defs=
edge.build.includes=-I{build.variant.path}/config
edge.build.libs=
edge.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
edge.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
edge.upload.use_menu_baud=0
edge.upload.baud=921600

###############################################################

amap3SBL.name=Abmiq SBL
amap3SBL.build.variant=SparkFun_Ambiq_SBL
amap3SBL.build.board=SFE_AMB_SBL
amap3SBL.upload.tool=artemis_bin2board
amap3SBL.upload.maximum_size=960000
amap3SBL.build.arch=APOLLO3
amap3SBL.build.mcu=cortex-m4
amap3SBL.build.f_cpu=48000000L
amap3SBL.build.core=arduino
amap3SBL.build.defs=
amap3SBL.build.includes=-I{build.variant.path}/config
amap3SBL.build.libs=
amap3SBL.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
amap3SBL.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
amap3SBL.upload.use_menu_baud=0
amap3SBL.upload.baud=115200

###############################################################

# edgeV2.name=SparkFun Edge V2
# edgeV2.build.variant=SparkFun_Edge_V2
# edgeV2.build.board=SFE_EDGE_V2
# edgeV2.upload.tool=artemis_uart
# edgeV2.upload.maximum_size=960000
# edgeV2.build.arch=APOLLO3
# edgeV2.build.mcu=cortex-m4
# edgeV2.build.f_cpu=48000000L
# edgeV2.build.core=arduino
# edgeV2.build.defs=
# edgeV2.build.includes=-I{build.variant.path}/config
# edgeV2.build.libs=
# edgeV2.build.extra_flags=-DPART_apollo3 -DAM_PACKAGE_BGA -DAM_PART_APOLLO3 
# edgeV2.build.ldscript={build.variant.path}/linker_scripts/gcc/flash_with_bootloader.ld
# edgeV2.upload.maximum_size=960000
# edge.upload.use_menu_baud=0
# edgeV2.upload.baud=115200

# ###############################################################

